---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningCutAll
source: html/f09e5328-4d64-58c2-9822-be9b8b3496df.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningCutAll Property

Opening completely removes its host

## Syntax (C#)
```csharp
public static FailureDefinitionId OpeningCutAll { get; }
```